leetcode_295_find_median_from_data_stream.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 295. Find Median from Data Stream</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><a href="index.html">Problem Solving</a></nav><div id="content" class="content">
<h1 class="title">Leetcode: 295. Find Median from Data Stream</h1>
<ul class="org-ul">
<li><a href="pattern_answer_query_on_sorted_data.html#ID-A18543C4-83BC-40F1-A243-B85FD935FAC0">Pattern: Answer query on sorted data</a>.  Keep a sorted list of the numbers and compute the median using it.  Time complexity is \(O(n \log n)\) and space is \(O(n)\).</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> sortedcontainers <span style="font-weight: bold;">import</span> SortedList


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">MedianFinder</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__init__</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">self</span>.s = SortedList()

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">addNum</span>(<span style="font-weight: bold;">self</span>, num: <span style="font-weight: bold;">int</span>) -&gt; <span style="font-weight: bold; text-decoration: underline;">None</span>:
        <span style="font-weight: bold;">self</span>.s.add(num)

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">findMedian</span>(<span style="font-weight: bold;">self</span>) -&gt; <span style="font-weight: bold;">float</span>:
        N = <span style="font-weight: bold;">len</span>(<span style="font-weight: bold;">self</span>.s)
        <span style="font-weight: bold;">if</span> N % 2 == 0:
            <span style="font-weight: bold;">return</span> (<span style="font-weight: bold;">self</span>.s[N // 2] + <span style="font-weight: bold;">self</span>.s[N // 2 - 1]) / 2
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">self</span>.s[N // 2]


<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Your MedianFinder object will be instantiated and called as such:</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">obj = MedianFinder()</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">obj.addNum(num)</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">param_2 = obj.findMedian()</span>
</pre>
</div>
</div>
</body>
</html>